{"PAD_None": 0, "BOS_None": 1, "EOS_None": 2, "NoteOn_21": 3, "NoteOn_22": 4, "NoteOn_23": 5, "NoteOn_24": 6, "NoteOn_25": 7, "NoteOn_26": 8, "NoteOn_27": 9, "NoteOn_28": 10, "NoteOn_29": 11, "NoteOn_30": 12, "NoteOn_31": 13, "NoteOn_32": 14, "NoteOn_33": 15, "NoteOn_34": 16, "NoteOn_35": 17, "NoteOn_36": 18, "NoteOn_37": 19, "NoteOn_38": 20, "NoteOn_39": 21, "NoteOn_40": 22, "NoteOn_41": 23, "NoteOn_42": 24, "NoteOn_43": 25, "NoteOn_44": 26, "NoteOn_45": 27, "NoteOn_46": 28, "NoteOn_47": 29, "NoteOn_48": 30, "NoteOn_49": 31, "NoteOn_50": 32, "NoteOn_51": 33, "NoteOn_52": 34, "NoteOn_53": 35, "NoteOn_54": 36, "NoteOn_55": 37, "NoteOn_56": 38, "NoteOn_57": 39, "NoteOn_58": 40, "NoteOn_59": 41, "NoteOn_60": 42, "NoteOn_61": 43, "NoteOn_62": 44, "NoteOn_63": 45, "NoteOn_64": 46, "NoteOn_65": 47, "NoteOn_66": 48, "NoteOn_67": 49, "NoteOn_68": 50, "NoteOn_69": 51, "NoteOn_70": 52, "NoteOn_71": 53, "NoteOn_72": 54, "NoteOn_73": 55, "NoteOn_74": 56, "NoteOn_75": 57, "NoteOn_76": 58, "NoteOn_77": 59, "NoteOn_78": 60, "NoteOn_79": 61, "NoteOn_80": 62, "NoteOn_81": 63, "NoteOn_82": 64, "NoteOn_83": 65, "NoteOn_84": 66, "NoteOn_85": 67, "NoteOn_86": 68, "NoteOn_87": 69, "NoteOn_88": 70, "NoteOn_89": 71, "NoteOn_90": 72, "NoteOn_91": 73, "NoteOn_92": 74, "NoteOn_93": 75, "NoteOn_94": 76, "NoteOn_95": 77, "NoteOn_96": 78, "NoteOn_97": 79, "NoteOn_98": 80, "NoteOn_99": 81, "NoteOn_100": 82, "NoteOn_101": 83, "NoteOn_102": 84, "NoteOn_103": 85, "NoteOn_104": 86, "NoteOn_105": 87, "NoteOn_106": 88, "NoteOn_107": 89, "NoteOn_108": 90, "NoteOff_21": 91, "NoteOff_22": 92, "NoteOff_23": 93, "NoteOff_24": 94, "NoteOff_25": 95, "NoteOff_26": 96, "NoteOff_27": 97, "NoteOff_28": 98, "NoteOff_29": 99, "NoteOff_30": 100, "NoteOff_31": 101, "NoteOff_32": 102, "NoteOff_33": 103, "NoteOff_34": 104, "NoteOff_35": 105, "NoteOff_36": 106, "NoteOff_37": 107, "NoteOff_38": 108, "NoteOff_39": 109, "NoteOff_40": 110, "NoteOff_41": 111, "NoteOff_42": 112, "NoteOff_43": 113, "NoteOff_44": 114, "NoteOff_45": 115, "NoteOff_46": 116, "NoteOff_47": 117, "NoteOff_48": 118, "NoteOff_49": 119, "NoteOff_50": 120, "NoteOff_51": 121, "NoteOff_52": 122, "NoteOff_53": 123, "NoteOff_54": 124, "NoteOff_55": 125, "NoteOff_56": 126, "NoteOff_57": 127, "NoteOff_58": 128, "NoteOff_59": 129, "NoteOff_60": 130, "NoteOff_61": 131, "NoteOff_62": 132, "NoteOff_63": 133, "NoteOff_64": 134, "NoteOff_65": 135, "NoteOff_66": 136, "NoteOff_67": 137, "NoteOff_68": 138, "NoteOff_69": 139, "NoteOff_70": 140, "NoteOff_71": 141, "NoteOff_72": 142, "NoteOff_73": 143, "NoteOff_74": 144, "NoteOff_75": 145, "NoteOff_76": 146, "NoteOff_77": 147, "NoteOff_78": 148, "NoteOff_79": 149, "NoteOff_80": 150, "NoteOff_81": 151, "NoteOff_82": 152, "NoteOff_83": 153, "NoteOff_84": 154, "NoteOff_85": 155, "NoteOff_86": 156, "NoteOff_87": 157, "NoteOff_88": 158, "NoteOff_89": 159, "NoteOff_90": 160, "NoteOff_91": 161, "NoteOff_92": 162, "NoteOff_93": 163, "NoteOff_94": 164, "NoteOff_95": 165, "NoteOff_96": 166, "NoteOff_97": 167, "NoteOff_98": 168, "NoteOff_99": 169, "NoteOff_100": 170, "NoteOff_101": 171, "NoteOff_102": 172, "NoteOff_103": 173, "NoteOff_104": 174, "NoteOff_105": 175, "NoteOff_106": 176, "NoteOff_107": 177, "NoteOff_108": 178, "Velocity_3": 179, "Velocity_7": 180, "Velocity_11": 181, "Velocity_15": 182, "Velocity_19": 183, "Velocity_23": 184, "Velocity_27": 185, "Velocity_31": 186, "Velocity_35": 187, "Velocity_39": 188, "Velocity_43": 189, "Velocity_47": 190, "Velocity_51": 191, "Velocity_55": 192, "Velocity_59": 193, "Velocity_63": 194, "Velocity_67": 195, "Velocity_71": 196, "Velocity_75": 197, "Velocity_79": 198, "Velocity_83": 199, "Velocity_87": 200, "Velocity_91": 201, "Velocity_95": 202, "Velocity_99": 203, "Velocity_103": 204, "Velocity_107": 205, "Velocity_111": 206, "Velocity_115": 207, "Velocity_119": 208, "Velocity_123": 209, "Velocity_127": 210, "TimeShift_0.1.8": 211, "TimeShift_0.2.8": 212, "TimeShift_0.3.8": 213, "TimeShift_0.4.8": 214, "TimeShift_0.5.8": 215, "TimeShift_0.6.8": 216, "TimeShift_0.7.8": 217, "TimeShift_1.0.8": 218, "TimeShift_1.1.8": 219, "TimeShift_1.2.8": 220, "TimeShift_1.3.8": 221, "TimeShift_1.4.8": 222, "TimeShift_1.5.8": 223, "TimeShift_1.6.8": 224, "TimeShift_1.7.8": 225, "TimeShift_2.0.8": 226, "TimeShift_2.1.8": 227, "TimeShift_2.2.8": 228, "TimeShift_2.3.8": 229, "TimeShift_2.4.8": 230, "TimeShift_2.5.8": 231, "TimeShift_2.6.8": 232, "TimeShift_2.7.8": 233, "TimeShift_3.0.8": 234, "TimeShift_3.1.8": 235, "TimeShift_3.2.8": 236, "TimeShift_3.3.8": 237, "TimeShift_3.4.8": 238, "TimeShift_3.5.8": 239, "TimeShift_3.6.8": 240, "TimeShift_3.7.8": 241, "TimeShift_4.0.4": 242, "TimeShift_4.1.4": 243, "TimeShift_4.2.4": 244, "TimeShift_4.3.4": 245, "TimeShift_5.0.4": 246, "TimeShift_5.1.4": 247, "TimeShift_5.2.4": 248, "TimeShift_5.3.4": 249, "TimeShift_6.0.4": 250, "TimeShift_6.1.4": 251, "TimeShift_6.2.4": 252, "TimeShift_6.3.4": 253, "TimeShift_7.0.4": 254, "TimeShift_7.1.4": 255, "TimeShift_7.2.4": 256, "TimeShift_7.3.4": 257, "TimeShift_8.0.4": 258, "TimeShift_8.1.4": 259, "TimeShift_8.2.4": 260, "TimeShift_8.3.4": 261, "TimeShift_9.0.4": 262, "TimeShift_9.1.4": 263, "TimeShift_9.2.4": 264, "TimeShift_9.3.4": 265, "TimeShift_10.0.4": 266, "TimeShift_10.1.4": 267, "TimeShift_10.2.4": 268, "TimeShift_10.3.4": 269, "TimeShift_11.0.4": 270, "TimeShift_11.1.4": 271, "TimeShift_11.2.4": 272, "TimeShift_11.3.4": 273, "TimeShift_12.0.4": 274}